# NameObject

## Description
Procedure NameObject assigns an object name to the next object created.

```pascal
PROCEDURE NameObject(objName : STRING);
```

```python

def vs.NameObject(objName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objName|STRING|Name to be assigned to object.|

## Examples
```pascal
NameObject('Part 5257');

Rect(0,2,2,0);

```

## Version
Availability: from MiniCAD
## Category
* Object Names